# _*_ coding:utf-8 _*-
# 作者：码尚学院_星瑶老师
# @Time: 2021/4/12
# @Email:2155896749@qq.com
# @File: dict字典类型.py
"""
dict字典数据类型（可变数据类型）：  可以存储多个元素，元素表示形式键值对方式 key:value
元素与元素之间通过,隔开
表示符   { key1:value1,key2:value2,....}
注意：1、key不可以重复的，否则取最后的值   key唯一值
    2、key必须是不可变数据类型（number,string,tuple）

"""
# for m in ["SYL_Z", "SYL_Y", "SYL_3Y", "SYL_6Y", "SYL_1N", "SYL_2N", "SYL_3N", "SYL_5N", "SYL_JN", "ANNSYL_LN"]:
#     if m in ["SYL_Z", "SYL_Y", "SYL_3Y", "SYL_6Y", "SYL_1N", "SYL_2N", "SYL_3N", "SYL_5N", "SYL_JN", "ANNSYL_LN",1,33,4]:
#         pass
#     else:
#         raise (f'{m}不在！')
m =  [5.62, 6.56, 17.46, 17.09, 3.58, 4.51, 8.46, 3.9, 9.65, 11.02, 13.24, 3.75, 27.46, 28.9, 13.12, 5.2, 5.67, 16.69, 24.09, 5.62, 9.36, 16.02, 0.69, 6.32, 15.06, 3.7, 5.16, 2.12, 8.58, 4.27, 4.48, 18.29, 5.07, 1.45, 16.94, 2.95, 3.48, 15.25, 3.16, 5.64, 12.65, 10.11, 4.14, 5.82, 3.52, 2.84, 4.96, 8.64, 8.12, 6.44, 16.68, 4.33, -2.23, 2.7, 21.24, 23.88, 26.98, 12.49, 3.92, 8.51, 23.75, 14.31, 14.59, 13.64, 6.41, 17.34, 21.52, 15.42, 4.36, 2.79, 5.22, 8.5, 32.23, 26.09, 8.74, 3.54, 13.17, 21.07, 12.94, 6.15, 9.13, 3.69, 2.61, 12.15, 7.11, 5.43, 6.05, 18.59, 14.3, 6.51, 17.61, 4.03, 5.16, 5.38, 7.26, 4.39, 21.53, 16.31, 7.09, 4.19, 20.07, 5.93, 3.51, 4.18, 25.47, 4.24, 44.39, 6.2, 7.23, 10.75, 20.01, 8.29, 6.01, 21.8, 11.98, 25.97, 5.45, 18.8, 5.99, 18.21, 56.67, 5.84]
print(len(m))
n =['10048775', '10326827', '10344283', '10623196', '12117610', '12117648', '12125870', '12321820', '12338097', '12566057', '12566194', '12566214', '12566321', '12979027', '12979333', '13205357', '13205368', '13254645', '13254886', '13254972', '13539466', '13793989', '13794010', '13794014', '13794023', '13948810', '14017515', '14167735', '14412319', '14556082', '14645849', '14647784', '14898621', '14898631', '14909901', '15100509', '15100739', '15131361', '15156747', '15156761', '15190016', '15190053']
print(len(n))




info={"name":"修习人生","class":"M211期"}
list0=[1,3,4]
print(set(list0),type(set(list0)))


# 需要循环读取到字典中所有的数据key,value
for x,y in info.items():
    print(x)

# 字典中某个元素值  ---->字典不能通过索引位置值来进行取值  取值：变量名[key]
print(info["name"],info["class"])
print(info.get("name"))
# 修改元素的值 --->value
info["class"]="M212期"
info["adree"]="深圳"
print(info)
# 删除元素
del info["adree"]
print(info)
info1=info.copy()
info.clear()
print(info)
print(info1)
# 创建一个字典，key确定，值不太确定，设置value-->默认值null
keys=["name","class","adress","xz"]
info2=dict.fromkeys(keys,"null")
print(info2)

# 字典合并  --->更新字典
print(info1)
add={"xz":18000,"qwxz":25000}
info1.update(add)
print(info1)
# 删除
print(info1)
# info1.pop("class")   #根据key进行删除
# print(info1)
info1.popitem()   # 默认删除最后一个元素
print(info1)
info1.clear()
print(info1)
del info1









